- name: ecs.version
  external: ecs
- name: error.message
  external: ecs
- name: event.category
  external: ecs
- name: event.created
  external: ecs
- name: event.kind
  external: ecs
- name: event.original
  external: ecs
- name: event.type
  external: ecs
- name: destination.as.number
  external: ecs
- name: destination.as.organization.name
  external: ecs
- name: destination.domain
  external: ecs
- name: destination.geo.city_name
  external: ecs
- name: destination.geo.continent_name
  external: ecs
- name: destination.geo.country_iso_code
  external: ecs
- name: destination.geo.country_name
  external: ecs
- name: destination.geo.location
  external: ecs
- name: destination.geo.region_iso_code
  external: ecs
- name: destination.geo.region_name
  external: ecs
- name: destination.geo.timezone
  external: ecs
- name: destination.ip
  external: ecs
- name: destination.port
  external: ecs
- name: http.request.body.content
  external: ecs
- name: http.request.method
  external: ecs
- name: http.response.body.bytes
  external: ecs
- name: http.response.body.content
  external: ecs
- name: http.response.status_code
  external: ecs
- name: network.direction
  external: ecs
- name: network.protocol
  external: ecs
- name: related.hash
  external: ecs
- name: related.hosts
  external: ecs
- name: related.ip
  external: ecs
- name: rule.author
  external: ecs
- name: rule.id
  external: ecs
- name: rule.name
  external: ecs
- name: tags
  external: ecs
- name: tls.server.x509.alternative_names
  external: ecs
- name: tls.server.x509.issuer.organization
  external: ecs
- name: tls.server.x509.not_after
  external: ecs
- name: tls.server.x509.not_before
  external: ecs
- name: tls.server.x509.serial_number
  external: ecs
- name: tls.server.x509.subject.common_name
  external: ecs
- name: tls.server.x509.subject.organization
  external: ecs
- name: url.domain
  external: ecs
- name: url.full
  external: ecs
- name: url.original
  external: ecs
- name: url.path
  external: ecs
- name: url.port
  external: ecs
- name: url.scheme
  external: ecs
- name: vulnerability.description
  external: ecs
- name: vulnerability.enumeration
  external: ecs
- name: vulnerability.id
  external: ecs
- name: vulnerability.reference
  external: ecs
- name: vulnerability.scanner.vendor
  external: ecs
  type: constant_keyword
  value: ProjectDiscovery
- name: vulnerability.score.base
  external: ecs
- name: vulnerability.score.version
  external: ecs
- name: vulnerability.severity
  external: ecs
